---
kind: property
id: P:Autodesk.Revit.DB.FillGrid.Origin
zh: 原点
source: html/f4c1d498-e54a-9f50-2776-f0c2ffcf1cd4.htm
---
# Autodesk.Revit.DB.FillGrid.Origin Property

**中文**: 原点

Gets and sets the origin of the fill grid.

## Syntax (C#)
```csharp
public UV Origin { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null